Revit 2027 API
ParameterTypeId.MaterialIdParam Property
 "Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialIdParam { get; }
Public Shared ReadOnly Property MaterialIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialIdParam {
	ForgeTypeId^ get ();
}
static member MaterialIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace